"ColorDistance" = "Color Distance";
"ColorDistanceDescription" = "A Core Image Kernel that selects pixels based on their distance from an input color.\n\nAll pixels which are within a specified distance from the color (the \"chromaTolerance\") are black. All others fade to white the farther from the specified color they are. The rate at which the pixels fade is determined by the falloff.\n\nDistances are normalized to 0.0-1.0";

"LuminanceDistance" = "Luminance Distance";
"LuminanceDistanceDescription" = "A Core Image Kernel that selects pixels below a specified luminance.\n\nAll pixels which are below the specified luminance (blackPoint) are black. All others fade to white at a rate controlled by falloff.";

"PerceptualDistance" = "Perceptual Distance";
"PerceptualDistanceDescription" = "A Core Image Kernel that plots the distance to a specified color, within a tolerance, using the CIE Lab perceptual color space.\n\nColors are mapped to the CIE Lab color space, which measures a perceptual color and luminance. Pixels which are within a specified distance of the color (chromaTolerance) and luminance (luminanceTolerance) are black. All other pixels fade to white at a rate controlled by falloff.\n\nDistances are normalized to 0.0-1.0";
